tylertms/dspic33e-sim/conformance/output_compare.c
static void pps_cases(OutputCompareConformance* state, Dspic33* cpu) {
    pps_case(state, cpu, 0u, 109u, 0x0698u, 0u, 0x10u);
    pps_case(state, cpu, 1u, 65u, 0x0680u, 8u, 0x11u);
    pps_case(state, cpu, 4u, 108u, 0x0696u, 8u, 0x14u);
    pps_case(state, cpu, 15u, 64u, 0x0680u, 0u, 0x2cu);
}

static void interrupt_cases(OutputCompareConformance* state, Dspic33* cpu) {
    uint8_t channel;
    for (channel = 0u; channel < DSPIC33_OUTPUT_COMPARE_COUNT; channel++) {
        dspic33_reset(cpu, 0u);
        configure_interrupt(cpu, channel);
        configure_compare(cpu, channel, 0u, 0u);
        expect(state, !dspic33_device_interrupt_pending(cpu),
               "OC interrupt is not pending before rollover");
        expect(state, dspic33_device_advance(cpu, 1u), "advance OC interrupt rollover");
        expect(state,
               interrupt_flag(cpu, channel) && dspic33_device_interrupt_pending(cpu),
               "OC interrupt becomes pending at rollover");
        expect(state,
               dspic33_device_service_interrupt(cpu) &&
                   cpu->last_interrupt == compare_irqs[channel] &&
                   cpu->pc == COMPARE_VECTOR,
               "OC channel uses documented interrupt vector");
    }
}

static void single_compare_cases(OutputCompareConformance* state, Dspic33* cpu) {
    static const bool initial[3] = {false, true, false};
    static const bool matched[3] = {true, false, true};
    uint8_t mode;
    for (mode = 1u; mode <= 3u; mode++) {
        dspic33_reset(cpu, 0u);
        configure_compare_mode(cpu, 0u, mode, 4u, 2u, COMPARE_SELF_SYNC);
        expect(state, output_is(cpu, 0u, initial[mode - 1u]),
               "single compare initializes documented level");
        expect(state, dspic33_device_advance(cpu, 2u),
               "advance single compare primary match");
        expect(state,
               output_is(cpu, 0u, initial[mode - 1u]) &&
                   dspic33_read_word(cpu, 0x0908u) == 2u && !interrupt_flag(cpu, 0u),
               "single compare match precedes output transition");
        expect(state, dspic33_device_advance(cpu, 1u),
               "advance single compare output pipeline");
        expect(state,
               output_is(cpu, 0u, matched[mode - 1u]) &&
                   dspic33_read_word(cpu, 0x0908u) == 3u && !interrupt_flag(cpu, 0u),
               "single compare output changes one clock after match");
        expect(state, dspic33_device_advance(cpu, 2u),
               "advance single compare interrupt pipeline");
        expect(state,
               output_is(cpu, 0u, matched[mode - 1u]) &&
                   dspic33_read_word(cpu, 0x0908u) == 0u && interrupt_flag(cpu, 0u),
               "single compare interrupt follows output by two clocks");
        clear_interrupt(cpu, 0u);
        expect(state, dspic33_device_advance(cpu, 2u),
               "advance single compare next-cycle match");
        expect(state,
               output_is(cpu, 0u, matched[mode - 1u]) && !interrupt_flag(cpu, 0u),
               "single compare next match does not change output immediately");
        expect(state, dspic33_device_advance(cpu, 1u),
               "advance single compare repeated output pipeline");
        expect(state,
               output_is(cpu, 0u, mode == 3u ? false : matched[mode - 1u]) &&
                   !interrupt_flag(cpu, 0u),
               "single-shot holds while toggle changes on the next clock");
        expect(state, dspic33_device_advance(cpu, 2u),
               "advance repeated single compare interrupt pipeline");
        expect(state, interrupt_flag(cpu, 0u) == (mode == 3u),
               "only toggle mode repeats its interrupt");
    }

    dspic33_reset(cpu, 0u);
    configure_compare_mode(cpu, 0u, 3u, 4u, 4u, COMPARE_SELF_SYNC);
    expect(state, dspic33_device_advance(cpu, 4u),
           "advance equal single compare and period");
    expect(state, output_is(cpu, 0u, false) && !interrupt_flag(cpu, 0u),
           "equal single compare records match before output");
    expect(state, dspic33_device_advance(cpu, 1u),
           "advance equal single compare output and boundary");
    expect(state,
           output_is(cpu, 0u, true) && dspic33_read_word(cpu, 0x0908u) == 0u &&
               !interrupt_flag(cpu, 0u),
           "equal single compare changes output on next clock");
    expect(state, dspic33_device_advance(cpu, 2u),
           "advance equal single compare interrupt");
    expect(state, interrupt_flag(cpu, 0u),
           "equal single compare raises delayed interrupt");

    dspic33_reset(cpu, 0u);
    configure_compare_mode(cpu, 0u, 1u, 3u, 0u, COMPARE_SELF_SYNC);
    expect(state, output_is(cpu, 0u, false), "zero single compare starts unchanged");
    expect(state, dspic33_device_advance(cpu, 4u),
           "advance zero single compare through first boundary");
    expect(state, output_is(cpu, 0u, false) && !interrupt_flag(cpu, 0u),
           "zero single compare remains initial at synchronization");
    expect(state, dspic33_device_advance(cpu, 8u),
           "advance zero single compare across later synchronizations");
    expect(state,
           output_is(cpu, 0u, false) && !interrupt_flag(cpu, 0u) &&
               cpu->io.output_compare.phase[0] == 0u,
           "zero single compare never generates an event while held in reset");

    dspic33_reset(cpu, 0u);
    configure_compare_mode(cpu, 0u, 1u, 3u, 0u, COMPARE_NO_SYNC);
    expect(state, dspic33_device_advance(cpu, UINT16_MAX + 1u),
           "advance zero free-running single compare to rollover");
    expect(state, output_is(cpu, 0u, false) && !interrupt_flag(cpu, 0u),
           "zero free-running single compare detects at rollover");
    expect(state, dspic33_device_advance(cpu, 1u),
           "advance zero free-running single compare output");
    expect(state, output_is(cpu, 0u, true) && !interrupt_flag(cpu, 0u),
           "zero free-running single compare changes after rollover");
    expect(state, dspic33_device_advance(cpu, 2u),
           "advance zero free-running single compare interrupt");
    expect(state, interrupt_flag(cpu, 0u),
           "zero free-running single compare raises delayed interrupt");

    for (mode = 1u; mode <= 3u; mode++) {
        dspic33_reset(cpu, 0u);
        configure_compare_mode(cpu, 0u, mode, 2u, 4u, COMPARE_SELF_SYNC);
        expect(state, dspic33_device_advance(cpu, 9u),
               "advance single compare beyond synchronization period");
        expect(state,
               output_is(cpu, 0u, mode == 2u) && !interrupt_flag(cpu, 0u) &&
                   cpu->io.output_compare.phase[0] == 0u,
               "single compare beyond period remains at initial level");
    }
}

static void dual_compare_cases(OutputCompareConformance* state, Dspic33* cpu) {
    uint8_t mode;
    for (mode = 4u; mode <= 5u; mode++) {
        dspic33_reset(cpu, 0u);
        configure_compare_mode(cpu, 0u, mode, 4u, 2u, COMPARE_SELF_SYNC);
        expect(state, output_is(cpu, 0u, false), "dual compare initializes low");
        expect(state, dspic33_device_advance(cpu, 2u),
               "advance dual compare rising edge");
        expect(state,
               output_is(cpu, 0u, false) && !interrupt_flag(cpu, 0u) &&
                   dspic33_read_word(cpu, 0x0908u) == 2u,
               "dual primary match precedes rising edge");
        expect(state, dspic33_device_advance(cpu, 1u),
               "advance dual compare rising pipeline");
        expect(state,
               output_is(cpu, 0u, true) && !interrupt_flag(cpu, 0u) &&
                   dspic33_read_word(cpu, 0x0908u) == 3u,
               "dual primary output changes one clock after match");
        expect(state, dspic33_device_advance(cpu, 1u),
               "advance dual compare secondary match");
        expect(state,
               output_is(cpu, 0u, true) && !interrupt_flag(cpu, 0u) &&
                   dspic33_read_word(cpu, 0x0908u) == 4u,
               "dual secondary match precedes falling edge");
        expect(state, dspic33_device_advance(cpu, 1u),
               "advance dual compare falling pipeline");
        expect(state,
               output_is(cpu, 0u, false) && !interrupt_flag(cpu, 0u) &&
                   dspic33_read_word(cpu, 0x0908u) == 0u,
               "dual secondary output changes one clock after match");
        expect(state, dspic33_device_advance(cpu, 2u),
               "advance dual compare interrupt pipeline");
        expect(state, output_is(cpu, 0u, false) && interrupt_flag(cpu, 0u),
               "dual interrupt follows falling edge by two clocks");
        clear_interrupt(cpu, 0u);
        expect(state, dspic33_device_advance(cpu, 1u),
               "advance continuous dual repeated rising pipeline");
        expect(state, output_is(cpu, 0u, mode == 5u) && !interrupt_flag(cpu, 0u),
               "dual single-shot stops while continuous mode repeats");
    }

    dspic33_reset(cpu, 0u);
    configure_compare_mode(cpu, 0u, 5u, 2u, 2u, COMPARE_SELF_SYNC);
    expect(state, dspic33_device_advance(cpu, 2u), "advance equal dual primary match");
    expect(state, output_is(cpu, 0u, false) && !interrupt_flag(cpu, 0u),
           "equal dual values detect primary before output");
    expect(state, dspic33_device_advance(cpu, 1u), "advance equal dual primary output");
    expect(state, output_is(cpu, 0u, true) && !interrupt_flag(cpu, 0u),
           "equal dual values raise output in first cycle");
    expect(state, dspic33_device_advance(cpu, 2u),
           "advance equal dual secondary match in next cycle");
    expect(state, output_is(cpu, 0u, true) && !interrupt_flag(cpu, 0u),
           "equal dual secondary match precedes output");
    expect(state, dspic33_device_advance(cpu, 1u),
           "advance equal dual secondary output");
    expect(state, output_is(cpu, 0u, false) && !interrupt_flag(cpu, 0u),
           "equal dual values lower output in following cycle");
    expect(state, dspic33_device_advance(cpu, 2u),
           "advance equal dual interrupt pipeline");
    expect(state, interrupt_flag(cpu, 0u), "equal dual values raise delayed interrupt");

    dspic33_reset(cpu, 0u);
    configure_compare_mode(cpu, 0u, 5u, 3u, 0u, COMPARE_SELF_SYNC);
    expect(state, dspic33_device_advance(cpu, 4u),
           "advance zero-primary dual first cycle");
    expect(state, output_is(cpu, 0u, false) && !interrupt_flag(cpu, 0u),
           "zero-primary dual records match at first synchronization");
    expect(state, dspic33_device_advance(cpu, 1u),
           "advance zero-primary dual rising pipeline");
    expect(state, output_is(cpu, 0u, true) && !interrupt_flag(cpu, 0u),
           "zero-primary dual rises after first synchronization");
    expect(state, dspic33_device_advance(cpu, 2u),
           "advance zero-primary dual secondary match");
    expect(state, output_is(cpu, 0u, true) && !interrupt_flag(cpu, 0u),
           "zero-primary dual secondary match precedes output");
    expect(state, dspic33_device_advance(cpu, 1u),
           "advance zero-primary dual falling pipeline");
    expect(state, output_is(cpu, 0u, false) && !interrupt_flag(cpu, 0u),
           "zero-primary dual falls after secondary match");
    expect(state, dspic33_device_advance(cpu, 2u),
           "advance zero-primary dual interrupt pipeline");
    expect(state, interrupt_flag(cpu, 0u),
           "zero-primary dual raises delayed interrupt");

    dspic33_reset(cpu, 0u);
    configure_compare_mode(cpu, 0u, 5u, 0u, 0u, COMPARE_SELF_SYNC);
    expect(state, dspic33_device_advance(cpu, 4u),
           "advance zero dual values across boundaries");
    expect(state,
           output_is(cpu, 0u, false) && !interrupt_flag(cpu, 0u) &&
               dspic33_read_word(cpu, 0x0908u) == 0u,
           "zero dual values remain low without interrupt");

    dspic33_reset(cpu, 0u);
    configure_compare_mode(cpu, 0u, 5u, 2u, 4u, COMPARE_NO_SYNC);
    expect(state, dspic33_device_advance(cpu, 4u),
           "advance reversed dual primary match");
    expect(state, output_is(cpu, 0u, false) && !interrupt_flag(cpu, 0u),
           "reversed dual primary match precedes output");
    expect(state, dspic33_device_advance(cpu, 1u),
           "advance reversed dual rising pipeline");
    expect(state, output_is(cpu, 0u, true) && !interrupt_flag(cpu, 0u),
           "reversed dual values raise output before rollover");
    expect(state, dspic33_device_advance(cpu, UINT16_MAX - 5u),
           "advance reversed dual to timer maximum");
    expect(state,
           output_is(cpu, 0u, true) && dspic33_read_word(cpu, 0x0908u) == UINT16_MAX,
           "reversed dual holds output through timer maximum");
    expect(state, dspic33_device_advance(cpu, 3u),
           "advance reversed dual across rollover to secondary match");
    expect(state,
           output_is(cpu, 0u, true) && dspic33_read_word(cpu, 0x0908u) == 2u &&
               !interrupt_flag(cpu, 0u),
           "reversed dual secondary match precedes output after rollover");
    expect(state, dspic33_device_advance(cpu, 1u),
           "advance reversed dual falling pipeline");
    expect(state, output_is(cpu, 0u, false) && !interrupt_flag(cpu, 0u),
           "reversed dual falls one clock after secondary match");
    expect(state, dspic33_device_advance(cpu, 2u),
           "advance reversed dual interrupt pipeline");
    expect(state, interrupt_flag(cpu, 0u), "reversed dual raises delayed interrupt");

    for (mode = 4u; mode <= 5u; mode++) {
        dspic33_reset(cpu, 0u);
        configure_compare_mode(cpu, 0u, mode, 2u, 4u, COMPARE_SELF_SYNC);
        expect(state, dspic33_device_advance(cpu, 9u),
               "advance self-synchronized reversed dual values");
        expect(state,
               output_is(cpu, 0u, false) && !interrupt_flag(cpu, 0u) &&
                   cpu->io.output_compare.phase[0] == 0u,
               "synchronization before primary compare suppresses dual pulse");
    }

    for (mode = 4u; mode <= 7u; mode++) {
        if (mode == 6u) {
            continue;
        }
        dspic33_reset(cpu, 0u);
        configure_compare_mode(cpu, 0u, mode, 0u, 0u, COMPARE_SELF_SYNC);
        expect(state, dspic33_device_advance(cpu, 4u),
               "advance zero dual values across mode");
        expect(state,
               output_is(cpu, 0u, false) && !interrupt_flag(cpu, 0u) &&
                   cpu->io.output_compare.phase[0] == 0u,
               "zero dual values suppress every pulse mode");
    }
}

static void center_aligned_cases(OutputCompareConformance* state, Dspic33* cpu) {
    dspic33_reset(cpu, 0u);
    configure_compare_mode(cpu, 0u, 7u, 4u, 2u, COMPARE_SELF_SYNC);
    expect(state, output_is(cpu, 0u, false), "center PWM initializes low");
    expect(state, dspic33_device_advance(cpu, 1u),
           "advance center PWM before buffered writes");
    dspic33_write_word(cpu, 0x0904u, 6u);
    dspic33_write_word(cpu, 0x0906u, 3u);
    expect(state,
           cpu->io.output_compare.active_rs[0] == 4u &&
               cpu->io.output_compare.active_r[0] == 2u,
           "center PWM compare writes remain buffered");
    expect(state, dspic33_device_advance(cpu, 1u), "advance center PWM primary match");
    expect(state, output_is(cpu, 0u, false) && !interrupt_flag(cpu, 0u),
           "center PWM primary match precedes output");
    expect(state, dspic33_device_advance(cpu, 1u),
           "advance center PWM rising pipeline");
    expect(state, output_is(cpu, 0u, true) && !interrupt_flag(cpu, 0u),
           "center PWM primary output changes one clock later");
    expect(state, dspic33_device_advance(cpu, 1u),
           "advance center PWM secondary match");
    expect(state, output_is(cpu, 0u, true) && !interrupt_flag(cpu, 0u),
           "center PWM secondary match precedes output");
    expect(state, dspic33_device_advance(cpu, 1u),
           "advance center PWM falling pipeline and boundary");
    expect(state,
           output_is(cpu, 0u, false) && !interrupt_flag(cpu, 0u) &&
               cpu->io.output_compare.active_rs[0] == 6u &&
               cpu->io.output_compare.active_r[0] == 3u &&
               dspic33_read_word(cpu, 0x0908u) == 0u,
           "center PWM falling edge and boundary load compare buffers");
    expect(state, dspic33_device_advance(cpu, 2u),
           "advance center PWM interrupt pipeline");
    expect(state, interrupt_flag(cpu, 0u),
           "center PWM interrupt follows falling edge by two clocks");
}

static void immediate_compare_write_cases(OutputCompareConformance* state,
                                          Dspic33* cpu) {
    dspic33_reset(cpu, 0u);
    configure_compare_mode(cpu, 0u, 3u, 6u, 4u, COMPARE_SELF_SYNC);
    expect(state, dspic33_device_advance(cpu, 1u),
           "advance before immediate primary write");
    dspic33_write_word(cpu, 0x0906u, 2u);
    expect(state,
           cpu->io.output_compare.active_r[0] == 2u &&
               dspic33_device_advance(cpu, 1u) && output_is(cpu, 0u, false) &&
               !interrupt_flag(cpu, 0u),
           "non-PWM primary write changes current compare cycle");
    expect(state, dspic33_device_advance(cpu, 1u),
           "advance immediate primary output pipeline");
    expect(state, output_is(cpu, 0u, true) && !interrupt_flag(cpu, 0u),
           "immediate primary write changes output after one clock");
    expect(state, dspic33_device_advance(cpu, 2u),
           "advance immediate primary interrupt pipeline");
    expect(state, interrupt_flag(cpu, 0u),
           "immediate primary write raises delayed interrupt");

    dspic33_reset(cpu, 0u);
    configure_compare_mode(cpu, 0u, 5u, 6u, 2u, COMPARE_SELF_SYNC);
    expect(state, dspic33_device_advance(cpu, 2u),
           "advance before immediate secondary write");
    expect(state, dspic33_device_advance(cpu, 1u),
           "advance primary output before secondary write");
    dspic33_write_word(cpu, 0x0904u, 4u);
    expect(state,
           cpu->io.output_compare.active_rs[0] == 4u &&
               dspic33_device_advance(cpu, 1u) && output_is(cpu, 0u, true) &&
               !interrupt_flag(cpu, 0u),
           "non-PWM secondary write changes current compare cycle");
    expect(state, dspic33_device_advance(cpu, 1u),
           "advance immediate secondary output pipeline");
    expect(state, output_is(cpu, 0u, false) && !interrupt_flag(cpu, 0u),
           "immediate secondary write changes output after one clock");
    expect(state, dspic33_device_advance(cpu, 2u),
           "advance immediate secondary interrupt pipeline");
    expect(state, interrupt_flag(cpu, 0u),
           "immediate secondary write raises delayed interrupt");

    dspic33_reset(cpu, 0u);
    configure_compare_mode(cpu, 0u, 1u, 4u, 2u, COMPARE_SELF_SYNC);
    expect(state, dspic33_device_advance(cpu, 2u),
           "advance primary match before compare rewrite");
    dspic33_write_word(cpu, 0x0906u, 3u);
    expect(state, dspic33_device_advance(cpu, 1u),
           "advance latched primary output after compare rewrite");
    expect(state, output_is(cpu, 0u, true) && !interrupt_flag(cpu, 0u),
           "primary compare rewrite preserves latched output event");
    expect(state, dspic33_device_advance(cpu, 2u),
           "advance latched primary interrupt after compare rewrite");
    expect(state, interrupt_flag(cpu, 0u),
           "primary compare rewrite preserves latched interrupt event");

    dspic33_reset(cpu, 0u);
    configure_compare_mode(cpu, 0u, 5u, 4u, 2u, COMPARE_SELF_SYNC);
    expect(state, dspic33_device_advance(cpu, 4u),
           "advance secondary match before compare rewrite");
    dspic33_write_word(cpu, 0x0904u, 6u);
    expect(state, dspic33_device_advance(cpu, 1u),
           "advance latched secondary output after compare rewrite");
    expect(state,
           output_is(cpu, 0u, false) && !interrupt_flag(cpu, 0u) &&
               cpu->io.output_compare.active_rs[0] == 6u,
           "secondary compare rewrite preserves latched output event");
    expect(state, dspic33_device_advance(cpu, 2u),
           "advance latched secondary interrupt after compare rewrite");
    expect(state, interrupt_flag(cpu, 0u),
           "secondary compare rewrite preserves latched interrupt event");
}

static void output_control_cases(OutputCompareConformance* state, Dspic33* cpu) {
    bool high;
    dspic33_reset(cpu, 0u);
    configure_compare_mode(cpu, 0u, 1u, 4u, 2u,
                           (uint16_t)(COMPARE_SELF_SYNC | 0x1000u));
    expect(state, output_is(cpu, 0u, true), "OCINV inverts initialized output");
    expect(state, dspic33_device_advance(cpu, 2u),
           "advance inverted single compare match");
    expect(state, output_is(cpu, 0u, true) && !interrupt_flag(cpu, 0u),
           "OCINV remains unchanged at compare match");
    expect(state, dspic33_device_advance(cpu, 1u), "advance inverted output pipeline");
    expect(state, output_is(cpu, 0u, false) && !interrupt_flag(cpu, 0u),
           "OCINV inverts delayed matched output");
    dspic33_write_word(cpu, 0x0902u, COMPARE_SELF_SYNC);
    expect(state, output_is(cpu, 0u, true) && dspic33_read_word(cpu, 0x0908u) == 3u,
           "live OCINV clear preserves timer and mode phase");

    dspic33_reset(cpu, 0u);
    configure_compare(cpu, 0u, 4u, 2u);
    dspic33_write_word(cpu, 0x0698u, 0x0010u);
    expect(state, pin_is(cpu, 109u, true), "driven OC pin is observable");
    dspic33_write_word(cpu, 0x0902u, (uint16_t)(COMPARE_SELF_SYNC | 0x0020u));
    expect(state,
           dspic33_output_compare_output(cpu, 0u, &high) && high &&
               !dspic33_output_compare_pin(cpu, 109u, &high),
           "OCTRIS disconnects pin without stopping module output");
    expect(state, dspic33_device_advance(cpu, 2u), "advance tri-stated OC module");
    dspic33_write_word(cpu, 0x0902u, COMPARE_SELF_SYNC);
    expect(state, pin_is(cpu, 109u, false),
           "clearing OCTRIS reconnects preserved module phase");
}

