tylertms/dspic33e-sim/conformance/output_compare.c
static void channel_mode_matrix_cases(OutputCompareConformance* state, Dspic33* cpu) {
    uint8_t channel;
    uint8_t mode;
    for (channel = 0u; channel < DSPIC33_OUTPUT_COMPARE_COUNT; channel++) {
        for (mode = 1u; mode <= 7u; mode++) {
            bool initial = mode == 2u || mode == 6u;
            bool primary_detection = mode == 2u;
            bool primary_output = mode != 2u && mode != 6u;
            bool boundary_output = mode == 1u || mode == 3u || mode == 6u;
            bool delayed_secondary_interrupt = mode == 4u || mode == 5u || mode == 7u;
            bool next_output = mode == 1u || mode == 5u || mode == 7u;
            uint16_t base = compare_base(channel);
            dspic33_reset(cpu, 0u);
            configure_compare_mode(cpu, channel, mode, 4u, 2u, COMPARE_SELF_SYNC);
            expect(state,
                   output_is(cpu, channel, initial) &&
                       dspic33_read_word(cpu, (uint16_t)(base + 8u)) == 0u,
                   "channel mode matrix initial state");
            expect(state, dspic33_device_advance(cpu, 2u),
                   "channel mode matrix primary advance");
            expect(state,
                   output_is(cpu, channel, primary_detection) &&
                       dspic33_read_word(cpu, (uint16_t)(base + 8u)) == 2u &&
                       !interrupt_flag(cpu, channel),
                   "channel mode matrix primary detection");
            expect(state, dspic33_device_advance(cpu, 1u),
                   "channel mode matrix primary output advance");
            expect(state,
                   output_is(cpu, channel, primary_output) &&
                       dspic33_read_word(cpu, (uint16_t)(base + 8u)) == 3u &&
                       !interrupt_flag(cpu, channel),
                   "channel mode matrix primary output pipeline");
            expect(state, dspic33_device_advance(cpu, 1u),
                   "channel mode matrix secondary advance");
            expect(state,
                   output_is(cpu, channel, primary_output) &&
                       dspic33_read_word(cpu, (uint16_t)(base + 8u)) == 4u &&
                       !interrupt_flag(cpu, channel),
                   "channel mode matrix secondary detection");
            expect(state, dspic33_device_advance(cpu, 1u),
                   "channel mode matrix boundary advance");
            expect(state,
                   output_is(cpu, channel, boundary_output) &&
                       dspic33_read_word(cpu, (uint16_t)(base + 8u)) == 0u &&
                       interrupt_flag(cpu, channel) == (mode <= 3u || mode == 6u),
                   "channel mode matrix output and first interrupt pipeline");
            clear_interrupt(cpu, channel);
            expect(state, dspic33_device_advance(cpu, 2u),
                   "channel mode matrix delayed interrupt advance");
            expect(state,
                   output_is(cpu, channel, mode == 1u || mode == 3u) &&
                       dspic33_read_word(cpu, (uint16_t)(base + 8u)) == 2u &&
                       interrupt_flag(cpu, channel) == delayed_secondary_interrupt,
                   "channel mode matrix delayed secondary interrupt");
            clear_interrupt(cpu, channel);
            expect(state, dspic33_device_advance(cpu, 1u),
                   "channel mode matrix next output advance");
            expect(state,
                   output_is(cpu, channel, next_output) &&
                       !interrupt_flag(cpu, channel),
                   "channel mode matrix next-cycle output pipeline");
        }
    }
}

static void one_shot_restart_cases(OutputCompareConformance* state, Dspic33* cpu) {
    dspic33_reset(cpu, 0u);
    configure_compare_mode(cpu, 0u, 4u, 4u, 2u, COMPARE_SELF_SYNC);
    expect(state, dspic33_device_advance(cpu, 7u), "advance first one-shot pulse");
    expect(state,
           output_is(cpu, 0u, false) && interrupt_flag(cpu, 0u) &&
               cpu->io.output_compare.phase[0] == 2u &&
               dspic33_read_word(cpu, 0x0908u) == 2u,
           "one-shot pulse reaches completed state");
    clear_interrupt(cpu, 0u);
    dspic33_write_byte(cpu, 0x0901u, 0x1cu);
    expect(state,
           cpu->io.output_compare.phase[0] == 2u &&
               dspic33_read_word(cpu, 0x0908u) == 2u,
           "high control byte write does not restart one-shot");
    dspic33_write_byte(cpu, 0x0900u, 0x04u);
    expect(state,
           output_is(cpu, 0u, false) && cpu->io.output_compare.phase[0] == 0u &&
               dspic33_read_word(cpu, 0x0908u) == 0u,
           "same mode low-byte write restarts one-shot");
    expect(state, dspic33_device_advance(cpu, 2u),
           "advance restarted one-shot primary match");
    expect(state, output_is(cpu, 0u, false) && !interrupt_flag(cpu, 0u),
           "restarted one-shot detects a new primary match");
    expect(state, dspic33_device_advance(cpu, 1u),
           "advance restarted one-shot output pipeline");
    expect(state, output_is(cpu, 0u, true) && !interrupt_flag(cpu, 0u),
           "restarted one-shot generates a delayed rising edge");
}

static void unsupported_case(OutputCompareConformance* state, Dspic33* cpu,
                             uint16_t control1, uint16_t control2, const char* name) {
    bool high;
    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, 0x0904u, 4u);
    dspic33_write_word(cpu, 0x0906u, 2u);
    dspic33_write_word(cpu, 0x0900u, control1);
    dspic33_write_word(cpu, 0x0902u, control2);
    expect(state, !dspic33_output_compare_output(cpu, 0u, &high), name);
    expect(state, dspic33_device_advance(cpu, 6u), "advance excluded OC tuple");
    expect(state,
           dspic33_read_word(cpu, 0x0908u) == 0u && cpu->events.count == 0u &&
               !interrupt_flag(cpu, 0u),
           "excluded OC tuple remains inactive");
}

static void cascade_pwm_cases(OutputCompareConformance* state, Dspic33* cpu) {
    uint8_t low;
    for (low = 0u; low < DSPIC33_OUTPUT_COMPARE_COUNT; low += 2u) {
        uint8_t high = (uint8_t)(low + 1u);
        uint16_t low_base = compare_base(low);
        uint16_t high_base = compare_base(high);
        bool value;
        dspic33_reset(cpu, 0u);
        configure_cascade(cpu, low, 6u, UINT32_C(0x00010004), UINT32_C(0x00010002),
                          COMPARE_FP, COMPARE_SELF_SYNC, false);
        expect(state,
               !dspic33_output_compare_output(cpu, low, &value) &&
                   output_is(cpu, high, false) && !interrupt_flag(cpu, low) &&
                   !interrupt_flag(cpu, high),
               "cascade exposes only the even output and interrupt owner");
        expect(state, dspic33_device_advance(cpu, UINT32_C(0x00010001)),
               "advance cascade before 32-bit compare");
        expect(state,
               compare_raw_word(cpu, (uint16_t)(low_base + 8u)) == 1u &&
                   compare_raw_word(cpu, (uint16_t)(high_base + 8u)) == 1u &&
                   output_is(cpu, high, false),
               "cascade carries low timer overflow into the high timer");
        expect(state, dspic33_device_advance(cpu, 1u),
               "advance cascade 32-bit compare");
        expect(state,
               compare_raw_word(cpu, (uint16_t)(low_base + 8u)) == 2u &&
                   compare_raw_word(cpu, (uint16_t)(high_base + 8u)) == 1u &&
                   output_is(cpu, high, true) && !interrupt_flag(cpu, high),
               "cascade compare drives the even output high");
        expect(state, dspic33_device_advance(cpu, 2u),
               "advance cascade through period value");
        expect(state,
               compare_raw_word(cpu, (uint16_t)(low_base + 8u)) == 4u &&
                   compare_raw_word(cpu, (uint16_t)(high_base + 8u)) == 1u &&
                   output_is(cpu, high, true) && !interrupt_flag(cpu, high),
               "cascade period value is the final high output cycle");
        expect(state, dspic33_device_advance(cpu, 1u),
               "advance cascade period boundary");
        expect(state,
               compare_raw_word(cpu, (uint16_t)(low_base + 8u)) == 0u &&
                   compare_raw_word(cpu, (uint16_t)(high_base + 8u)) == 0u &&
                   output_is(cpu, high, false) && interrupt_flag(cpu, high) &&
                   !interrupt_flag(cpu, low),
               "cascade period resets both timers and raises even interrupt");
    }
}

static void cascade_mode_cases(OutputCompareConformance* state, Dspic33* cpu) {
    uint8_t mode;
    for (mode = 1u; mode <= 7u; mode++) {
        uint32_t primary = mode >= 6u ? UINT32_C(0x00010002) : 2u;
        uint32_t secondary = mode >= 6u ? UINT32_C(0x00010004) : 4u;
        bool initial_high = mode == 2u;
        dspic33_reset(cpu, 0u);
        configure_cascade(cpu, 0u, mode, secondary, primary, COMPARE_FP,
                          COMPARE_SELF_SYNC, false);
        expect(state, output_is(cpu, 1u, initial_high),
               "cascade mode initializes the even output");
        expect(state, dspic33_device_advance(cpu, primary),
               "advance cascade mode to primary compare");
        expect(state,
               compare_raw_word(cpu, 0x0908u) == (uint16_t)primary &&
                   compare_raw_word(cpu, 0x0912u) == (uint16_t)(primary >> 16u) &&
                   output_is(cpu, 1u, mode == 2u || mode == 6u) &&
                   !interrupt_flag(cpu, 0u) && !interrupt_flag(cpu, 1u),
               "cascade mode detects its 32-bit primary compare");
        if (mode != 6u) {
            expect(state, dspic33_device_advance(cpu, 1u),
                   "advance cascade primary output pipeline");
            expect(state, output_is(cpu, 1u, mode != 2u) && !interrupt_flag(cpu, 1u),
                   "cascade primary pipeline updates only the even output");
        }
        if (mode >= 4u && mode != 6u) {
            expect(state, dspic33_device_advance(cpu, secondary - primary - 1u),
                   "advance cascade mode to secondary compare");
            expect(state,
                   compare_raw_word(cpu, 0x0908u) == (uint16_t)secondary &&
                       cpu->io.output_compare.phase[0] != 1u,
                   "cascade mode detects its 32-bit secondary compare");
            expect(state, dspic33_device_advance(cpu, 1u),
                   "advance cascade secondary output pipeline");
            expect(state, output_is(cpu, 1u, false),
                   "cascade secondary pipeline lowers the even output");
        }
    }
}

