tylertms/dspic33e-sim/conformance/output_compare.c
static void cascade_configuration_cases(OutputCompareConformance* state, Dspic33* cpu) {
    static const struct {
        uint16_t low_control1;
        uint16_t low_control2;
        uint16_t high_control1;
        uint16_t high_control2;
    } invalid[] = {
        {0x1c06u, 0x013fu, 0x0000u, 0x001fu}, {0x1c06u, 0x011fu, 0x1c06u, 0x011fu},
        {0x1c06u, 0x013fu, 0x1c06u, 0x013fu}, {0x1c06u, 0x013fu, 0x1c06u, 0x019fu},
        {0x1c06u, 0x013fu, 0x1806u, 0x011fu}, {0x1c06u, 0x013fu, 0x1c05u, 0x011fu},
        {0x1c06u, 0x013fu, 0x1c06u, 0x011eu},
    };
    size_t index;
    for (index = 0u; index < sizeof(invalid) / sizeof(invalid[0]); index++) {
        bool high;
        dspic33_reset(cpu, 0u);
        dspic33_write_word(cpu, 0x0902u, invalid[index].low_control2);
        dspic33_write_word(cpu, 0x090cu, invalid[index].high_control2);
        dspic33_write_word(cpu, 0x090au, invalid[index].high_control1);
        dspic33_write_word(cpu, 0x0900u, invalid[index].low_control1);
        expect(state,
               !dspic33_output_compare_output(cpu, 0u, &high) &&
                   !dspic33_output_compare_output(cpu, 1u, &high) &&
                   cpu->events.count == 0u,
               "invalid cascade pairing remains inactive");
        expect(state, dspic33_device_advance(cpu, 8u),
               "advance invalid cascade pairing");
        expect(state,
               compare_raw_word(cpu, 0x0908u) == 0u &&
                   compare_raw_word(cpu, 0x0912u) == 0u && !interrupt_flag(cpu, 0u) &&
                   !interrupt_flag(cpu, 1u),
               "invalid cascade pairing cannot count or interrupt");
    }

    dspic33_reset(cpu, 0u);
    configure_cascade(cpu, 0u, 6u, UINT32_C(0x00010004), UINT32_C(0x00010002),
                      COMPARE_FP, COMPARE_SELF_SYNC, false);
    expect(state, dspic33_device_advance(cpu, 3u),
           "advance cascade before live mismatch");
    dspic33_write_word(cpu, 0x090au, 0x1806u);
    expect(state,
           compare_raw_word(cpu, 0x0908u) == 0u &&
               compare_raw_word(cpu, 0x0912u) == 0u && !output_is(cpu, 1u, true),
           "live cascade mismatch stops both timer halves");
    dspic33_write_word(cpu, 0x090au, 0x1c06u);
    expect(state,
           compare_raw_word(cpu, 0x0908u) == 0u &&
               compare_raw_word(cpu, 0x0912u) == 0u && output_is(cpu, 1u, false),
           "restoring a valid cascade restarts both timer halves");
}

static void cascade_buffering_cases(OutputCompareConformance* state, Dspic33* cpu) {
    dspic33_reset(cpu, 0u);
    configure_cascade(cpu, 0u, 6u, UINT32_C(0x00010004), UINT32_C(0x00010002),
                      COMPARE_FP, COMPARE_SELF_SYNC, false);
    expect(state, dspic33_device_advance(cpu, 1u),
           "advance cascade before buffered writes");
    dspic33_write_word(cpu, 0x0904u, 6u);
    dspic33_write_word(cpu, 0x090eu, 2u);
    dspic33_write_word(cpu, 0x0906u, 3u);
    dspic33_write_word(cpu, 0x0910u, 2u);
    expect(state,
           cpu->io.output_compare.active_rs[0] == 4u &&
               cpu->io.output_compare.active_rs[1] == 1u &&
               cpu->io.output_compare.active_r[0] == 2u &&
               cpu->io.output_compare.active_r[1] == 1u,
           "cascade PWM buffers both halves of R and RS");
    expect(state, dspic33_device_advance(cpu, UINT32_C(0x00010001)),
           "advance cascade to old buffered compare");
    expect(state, output_is(cpu, 1u, true),
           "cascade PWM uses the old 32-bit compare before rollover");
    expect(state, dspic33_device_advance(cpu, 3u),
           "advance cascade through old buffered period");
    expect(state,
           compare_raw_word(cpu, 0x0908u) == 0u &&
               compare_raw_word(cpu, 0x0912u) == 0u &&
               cpu->io.output_compare.active_rs[0] == 6u &&
               cpu->io.output_compare.active_rs[1] == 2u &&
               cpu->io.output_compare.active_r[0] == 3u &&
               cpu->io.output_compare.active_r[1] == 2u && output_is(cpu, 1u, false),
           "cascade PWM loads both buffered halves at the old period boundary");
    clear_interrupt(cpu, 1u);
    expect(state, dspic33_device_advance(cpu, UINT32_C(0x00020003)),
           "advance cascade to new buffered compare");
    expect(state, output_is(cpu, 1u, true) && !interrupt_flag(cpu, 1u),
           "cascade PWM applies the new 32-bit compare after rollover");

    dspic33_reset(cpu, 0u);
    configure_cascade(cpu, 0u, 1u, UINT32_C(0x00030000), UINT32_C(0x00010002),
                      COMPARE_FP, COMPARE_SELF_SYNC, false);
    expect(state, dspic33_device_advance(cpu, 1u),
           "advance non-PWM cascade before immediate write");
    dspic33_write_word(cpu, 0x0910u, 2u);
    expect(state,
           cpu->io.output_compare.active_r[0] == 2u &&
               cpu->io.output_compare.active_r[1] == 2u,
           "non-PWM cascade applies a high-half compare write immediately");
    expect(state, dspic33_device_advance(cpu, UINT32_C(0x00020001)),
           "advance non-PWM cascade to rewritten compare");
    expect(state,
           compare_raw_word(cpu, 0x0908u) == 2u &&
               compare_raw_word(cpu, 0x0912u) == 2u && output_is(cpu, 1u, false),
           "non-PWM cascade reschedules the full 32-bit compare");
    expect(state, dspic33_device_advance(cpu, 1u),
           "advance non-PWM cascade output pipeline");
    expect(state, output_is(cpu, 1u, true),
           "rewritten non-PWM cascade drives the even output");
}

static void cascade_trigger_cases(OutputCompareConformance* state, Dspic33* cpu) {
    dspic33_reset(cpu, 0u);
    configure_compare_source(cpu, 0u, 1u, 1u, COMPARE_SELF_SYNC);
    configure_cascade(cpu, 2u, 1u, 10u, 2u, COMPARE_FP, 1u, true);
    expect(state,
           (compare_raw_word(cpu, 0x0916u) & COMPARE_TRIGGER_STATUS) == 0u &&
               compare_raw_word(cpu, 0x091cu) == 0u &&
               compare_raw_word(cpu, 0x0926u) == 0u,
           "triggered cascade holds both timer halves in reset");
    expect(state, dspic33_device_advance(cpu, 2u), "advance source to cascade trigger");
    expect(state,
           (compare_raw_word(cpu, 0x0916u) & COMPARE_TRIGGER_STATUS) != 0u &&
               compare_raw_word(cpu, 0x091cu) == 0u &&
               compare_raw_word(cpu, 0x0926u) == 0u,
           "cascade trigger releases without counting on the source edge");
    expect(state, dspic33_device_advance(cpu, 1u),
           "advance first cascade clock after trigger");
    expect(state,
           compare_raw_word(cpu, 0x091cu) == 1u && compare_raw_word(cpu, 0x0926u) == 0u,
           "triggered cascade begins on the following selected clock");
    expect(state, dspic33_device_advance(cpu, 1u), "advance triggered cascade compare");
    expect(state, cpu->io.output_compare.phase[2] == 2u,
           "triggered cascade detects the paired compare");

    dspic33_reset(cpu, 0u);
    configure_compare_source(cpu, 0u, 1u, 1u, COMPARE_SELF_SYNC);
    configure_cascade(cpu, 2u, 1u, 0u, 5u, COMPARE_FP, 1u, false);
    expect(state, dspic33_device_advance(cpu, 1u),
           "advance synchronized cascade before source");
    expect(state, compare_raw_word(cpu, 0x091cu) == 1u,
           "synchronized cascade counts before the source event");
    expect(state, dspic33_device_advance(cpu, 1u),
           "advance synchronized cascade source event");
    expect(state,
           (cpu->io.output_compare.sync_reset_pending & (1u << 2u)) != 0u &&
               compare_raw_word(cpu, 0x091cu) == 2u,
           "cascade synchronization waits for the next selected clock");
    expect(state, dspic33_device_advance(cpu, 1u),
           "advance cascade synchronization boundary");
    expect(state,
           compare_raw_word(cpu, 0x091cu) == 0u &&
               compare_raw_word(cpu, 0x0926u) == 0u &&
               (cpu->io.output_compare.sync_reset_pending & (1u << 2u)) == 0u,
           "cascade synchronization resets both timer halves together");
}

static void cascade_power_cases(OutputCompareConformance* state, Dspic33* cpu) {
    uint8_t member;
    bool high;
    dspic33_reset(cpu, 0u);
    configure_cascade(cpu, 0u, 6u, UINT32_C(0x00010004), UINT32_C(0x00010002),
                      COMPARE_FP, COMPARE_SELF_SYNC, false);
    expect(state, dspic33_device_advance(cpu, 1u), "advance cascade before Sleep");
    cpu->power_state = DSPIC33_POWER_SLEEP;
    dspic33_device_power_state_changed(cpu);
    expect(state, dspic33_device_advance(cpu, 16u), "advance cascade through Sleep");
    expect(state,
           compare_raw_word(cpu, 0x0908u) == 1u && compare_raw_word(cpu, 0x0912u) == 0u,
           "Sleep holds both cascade timer halves");
    cpu->power_state = DSPIC33_POWER_ACTIVE;
    dspic33_device_power_state_changed(cpu);
    expect(state,
           dspic33_device_advance(cpu, 1u) && compare_raw_word(cpu, 0x0908u) == 2u,
           "cascade resumes from retained Sleep phase");

