tylertms/dspic33e-sim/conformance/output_compare.c
    for (member = 0u; member < 2u; member++) {
        uint16_t base = compare_base(member);
        dspic33_reset(cpu, 0u);
        configure_cascade(cpu, 0u, 6u, UINT32_C(0x00010004), UINT32_C(0x00010002),
                          COMPARE_FP, COMPARE_SELF_SYNC, false);
        expect(state, dspic33_device_advance(cpu, 1u),
               "advance cascade before pair OCSIDL");
        dspic33_write_word(cpu, base,
                           (uint16_t)(dspic33_read_word(cpu, base) | 0x2000u));
        cpu->power_state = DSPIC33_POWER_IDLE;
        dspic33_device_power_state_changed(cpu);
        expect(state, dspic33_device_advance(cpu, 8u),
               "advance cascade pair through OCSIDL");
        expect(state, compare_raw_word(cpu, 0x0908u) == 1u && output_is(cpu, 1u, false),
               "OCSIDL on either cascade half pauses the pair");
        cpu->power_state = DSPIC33_POWER_ACTIVE;
        dspic33_device_power_state_changed(cpu);
        expect(state,
               dspic33_device_advance(cpu, 1u) && compare_raw_word(cpu, 0x0908u) == 2u,
               "cascade resumes after leaving OCSIDL");
    }

    for (member = 0u; member < 2u; member++) {
        uint16_t pmd_address = compare_pmd_address(member);
        uint16_t pmd_mask = compare_pmd_mask(member);
        dspic33_reset(cpu, 0u);
        configure_cascade(cpu, 0u, 6u, UINT32_C(0x00010004), UINT32_C(0x00010002),
                          COMPARE_FP, COMPARE_SELF_SYNC, false);
        expect(state, dspic33_device_advance(cpu, 1u),
               "advance cascade before pair PMD disable");
        dspic33_write_word(cpu, pmd_address,
                           (uint16_t)(dspic33_read_word(cpu, pmd_address) | pmd_mask));
        expect(state, dspic33_device_advance(cpu, 1u),
               "advance cascade pair PMD disable boundary");
        expect(state, dspic33_device_advance(cpu, 8u), "advance disabled cascade pair");
        expect(state,
               compare_raw_word(cpu, 0x0908u) == 2u &&
                   compare_raw_word(cpu, 0x0912u) == 0u &&
                   !dspic33_output_compare_output(cpu, 1u, &high),
               "disabling either cascade half pauses the pair");
        dspic33_write_word(cpu, pmd_address,
                           (uint16_t)(dspic33_read_word(cpu, pmd_address) & ~pmd_mask));
        expect(state, dspic33_device_advance(cpu, 1u),
               "advance cascade pair PMD enable boundary");
        expect(state,
               dspic33_device_advance(cpu, 1u) &&
                   compare_raw_word(cpu, 0x0908u) == 3u && output_is(cpu, 1u, false),
               "cascade resumes only after both halves are PMD-enabled");
    }
}

static void cascade_lifecycle_cases(OutputCompareConformance* state, Dspic33* cpu) {
    Dspic33 copy;
    bool copy_initialized;
    dspic33_reset(cpu, 0u);
    configure_cascade(cpu, 0u, 6u, UINT32_C(0x00010004), UINT32_C(0x00010002),
                      COMPARE_FP, COMPARE_SELF_SYNC, false);
    expect(state, dspic33_device_advance(cpu, 1u), "advance cascade before copy");
    copy_initialized = dspic33_initialize(&copy);
    expect(state, copy_initialized && dspic33_copy(&copy, cpu),
           "copy active cascade state");
    if (copy_initialized) {
        expect(state,
               dspic33_device_advance(cpu, 2u) && dspic33_device_advance(&copy, 3u) &&
                   compare_raw_word(cpu, 0x0908u) == 3u &&
                   compare_raw_word(&copy, 0x0908u) == 4u,
               "copied cascade timers advance independently");
        dspic33_destroy(&copy);
    }

    dspic33_reset(cpu, 0u);
    configure_cascade(cpu, 0u, 6u, UINT32_C(0x00010004), UINT32_C(0x00010002),
                      COMPARE_FP, COMPARE_SELF_SYNC, false);
    expect(state, dspic33_device_advance(cpu, 1u), "advance cascade before reset");
    dspic33_reset(cpu, 0u);
    expect(state,
           compare_raw_word(cpu, 0x0908u) == 0u &&
               compare_raw_word(cpu, 0x0912u) == 0u &&
               cpu->io.output_compare.output_high == 0u && cpu->events.count == 0u,
           "reset clears cascade timers output and events");

    dspic33_reset(cpu, 0u);
    cpu->device_cycles = UINT64_MAX;
    configure_cascade(cpu, 0u, 6u, UINT32_C(0x00010004), UINT32_C(0x00010002),
                      COMPARE_FP, COMPARE_SELF_SYNC, false);
    expect(state,
           cpu->stop_reason == DSPIC33_EVENT_QUEUE_ERROR &&
               (compare_raw_word(cpu, 0x0900u) & 7u) == 0u &&
               (compare_raw_word(cpu, 0x090au) & 7u) == 0u &&
               compare_raw_word(cpu, 0x0908u) == 0u &&
               compare_raw_word(cpu, 0x0912u) == 0u && cpu->events.count == 0u,
           "cascade schedule failure atomically aborts both halves");
}

static void cascade_clock_cases(OutputCompareConformance* state, Dspic33* cpu) {
    static const uint16_t clocks[] = {0x0000u, 0x0400u, 0x0800u, 0x0c00u, 0x1000u};
    static const uint8_t timers[] = {1u, 2u, 3u, 4u, 0u};
    size_t index;
    for (index = 0u; index < sizeof(clocks) / sizeof(clocks[0]); index++) {
        uint8_t timer = timers[index];
        dspic33_reset(cpu, 0u);
        dspic33_write_word(cpu, timer_periods[timer], UINT16_MAX);
        dspic33_write_word(cpu, timer_controls[timer], 0x8000u);
        configure_cascade(cpu, 0u, 6u, UINT32_C(0x00010004), UINT32_C(0x00010002),
                          clocks[index], COMPARE_SELF_SYNC, false);
        expect(state, dspic33_device_advance(cpu, UINT32_C(0x00010001)),
               "advance alternate-clock cascade before compare");
        expect(state,
               compare_raw_word(cpu, 0x0908u) == 1u &&
                   compare_raw_word(cpu, 0x0912u) == 1u && output_is(cpu, 1u, false),
               "alternate clock carries the cascade low timer into high timer");
        expect(state, dspic33_device_advance(cpu, 1u),
               "advance alternate-clock cascade compare");
        expect(state,
               compare_raw_word(cpu, 0x0908u) == 2u &&
                   compare_raw_word(cpu, 0x0912u) == 1u && output_is(cpu, 1u, true),
               "alternate clock drives the cascaded even output");
    }

    dspic33_reset(cpu, 0u);
    configure_cascade(cpu, 0u, 1u, 0u, UINT32_C(0xfffffffe), COMPARE_FP,
                      COMPARE_NO_SYNC, false);
    expect(state, dspic33_device_advance(cpu, UINT32_C(0xfffffffe)),
           "advance free-running cascade to maximum compare");
    expect(state,
           compare_raw_word(cpu, 0x0908u) == 0xfffeu &&
               compare_raw_word(cpu, 0x0912u) == 0xffffu &&
               cpu->io.output_compare.phase[0] == 2u,
           "free-running cascade reaches the full 32-bit compare");
    expect(state, dspic33_device_advance(cpu, 2u),
           "advance free-running cascade through 32-bit rollover");
    expect(state,
           compare_raw_word(cpu, 0x0908u) == 0u && compare_raw_word(cpu, 0x0912u) == 0u,
           "free-running cascade rolls over both timer halves at 32 bits");

    dspic33_reset(cpu, 0u);
    configure_cascade(cpu, 0u, 6u, 6u, 3u, COMPARE_FP, COMPARE_SELF_SYNC, false);
    {
        Dspic33 stepped;
        bool initialized = dspic33_initialize(&stepped);
        expect(state, initialized && dspic33_copy(&stepped, cpu),
               "copy cascade for batch equivalence");
        if (initialized) {
            uint8_t tick;
            expect(state, dspic33_device_advance(cpu, 7u),
                   "advance cascade in one batch");
            for (tick = 0u; tick < 7u; tick++) {
                expect(state, dspic33_device_advance(&stepped, 1u),
                       "advance cascade one selected clock");
            }
            expect(state,
                   compare_raw_word(cpu, 0x0908u) ==
                           compare_raw_word(&stepped, 0x0908u) &&
                       compare_raw_word(cpu, 0x0912u) ==
                           compare_raw_word(&stepped, 0x0912u) &&
                       cpu->io.output_compare.output_high ==
                           stepped.io.output_compare.output_high &&
                       interrupt_flag(cpu, 1u) == interrupt_flag(&stepped, 1u),
                   "cascade batched and stepped advancement are equivalent");
            dspic33_destroy(&stepped);
        }
    }
}

