tylertms/dspic33e-sim/conformance/output_compare.c
static void cascade_pipeline_cases(OutputCompareConformance* state, Dspic33* cpu) {
    dspic33_reset(cpu, 0u);
    configure_cascade(cpu, 0u, 1u, 10u, 2u, COMPARE_FP, COMPARE_SELF_SYNC, false);
    expect(state, dspic33_device_advance(cpu, 2u),
           "advance cascade single compare match");
    expect(state, output_is(cpu, 1u, false) && !interrupt_flag(cpu, 1u),
           "cascade single compare match precedes its output pipeline");
    expect(state, dspic33_device_advance(cpu, 1u),
           "advance cascade single output pipeline");
    expect(state, output_is(cpu, 1u, true) && !interrupt_flag(cpu, 1u),
           "cascade single output changes one clock after compare");
    expect(state, dspic33_device_advance(cpu, 2u),
           "advance cascade single interrupt pipeline");
    expect(state, interrupt_flag(cpu, 1u) && !interrupt_flag(cpu, 0u),
           "cascade single interrupt follows the even output by two clocks");

    dspic33_reset(cpu, 0u);
    configure_cascade(cpu, 0u, 5u, 10u, 2u, COMPARE_FP, COMPARE_SELF_SYNC, false);
    expect(state, dspic33_device_advance(cpu, 2u),
           "advance cascade dual primary compare");
    expect(state, dspic33_device_advance(cpu, 1u) && output_is(cpu, 1u, true),
           "cascade dual primary output is delayed one clock");
    expect(state, dspic33_device_advance(cpu, 7u),
           "advance cascade dual secondary compare");
    expect(state, output_is(cpu, 1u, true) && !interrupt_flag(cpu, 1u),
           "cascade dual secondary compare precedes its output pipeline");
    expect(state, dspic33_device_advance(cpu, 1u),
           "advance cascade dual secondary output");
    expect(state, output_is(cpu, 1u, false) && !interrupt_flag(cpu, 1u),
           "cascade dual secondary output is delayed one clock");
    expect(state, dspic33_device_advance(cpu, 2u),
           "advance cascade dual interrupt pipeline");
    expect(state, interrupt_flag(cpu, 1u) && !interrupt_flag(cpu, 0u),
           "cascade dual interrupt follows the even output by two clocks");
}

static void cascade_short_pwm_cases(OutputCompareConformance* state, Dspic33* cpu) {
    dspic33_reset(cpu, 0u);
    configure_cascade(cpu, 0u, 6u, 4u, UINT32_C(0x00010002), COMPARE_FP,
                      COMPARE_SELF_SYNC, false);
    expect(state, dspic33_device_advance(cpu, 4u),
           "advance zero-even-period cascade through low RS");
    expect(state,
           compare_raw_word(cpu, 0x0908u) == 4u &&
               compare_raw_word(cpu, 0x0912u) == 0u && output_is(cpu, 1u, false) &&
               !interrupt_flag(cpu, 1u),
           "zero even RS ignores the low-half period value");
    expect(state, dspic33_device_advance(cpu, UINT32_C(0x0000fffe)),
           "advance zero-even-period cascade to compare");
    expect(state, output_is(cpu, 1u, true) && !interrupt_flag(cpu, 1u),
           "zero even RS raises the output at the full compare");
    expect(state, dspic33_device_advance(cpu, UINT32_MAX - UINT32_C(0x00010002)),
           "advance zero-even-period cascade to 32-bit maximum");
    expect(state,
           compare_raw_word(cpu, 0x0908u) == UINT16_MAX &&
               compare_raw_word(cpu, 0x0912u) == UINT16_MAX &&
               output_is(cpu, 1u, true) && !interrupt_flag(cpu, 1u),
           "zero even RS holds high through the full timer range");
    expect(state, dspic33_device_advance(cpu, 1u),
           "advance zero-even-period cascade rollover");
    expect(state,
           compare_raw_word(cpu, 0x0908u) == 0u &&
               compare_raw_word(cpu, 0x0912u) == 0u && output_is(cpu, 1u, true) &&
               interrupt_flag(cpu, 1u),
           "zero even RS resets only at 32-bit overflow and remains high");

    dspic33_reset(cpu, 0u);
    configure_cascade(cpu, 0u, 6u, UINT32_C(0x00010004), 2u, COMPARE_FP,
                      COMPARE_SELF_SYNC, false);
    expect(state, dspic33_device_advance(cpu, 4u),
           "advance zero-even-compare cascade through low RS");
    expect(state,
           compare_raw_word(cpu, 0x0908u) == 4u &&
               compare_raw_word(cpu, 0x0912u) == 0u && output_is(cpu, 1u, true) &&
               !interrupt_flag(cpu, 1u),
           "zero even R remains high past the low-half period value");
    expect(state, dspic33_device_advance(cpu, UINT32_C(0x0000fffc)),
           "advance zero-even-compare cascade to first carry");
    expect(state,
           compare_raw_word(cpu, 0x0908u) == 0u &&
               compare_raw_word(cpu, 0x0912u) == 0u && output_is(cpu, 1u, true) &&
               interrupt_flag(cpu, 1u),
           "zero even R clears the high timer on its RS match and remains high");

    dspic33_reset(cpu, 0u);
    configure_cascade(cpu, 0u, 6u, 4u, 2u, COMPARE_FP, COMPARE_SELF_SYNC, false);
    expect(state, dspic33_device_advance(cpu, 4u),
           "advance all-short cascade through low period value");
    expect(state,
           compare_raw_word(cpu, 0x0908u) == 4u &&
               compare_raw_word(cpu, 0x0912u) == 0u && output_is(cpu, 1u, true) &&
               !interrupt_flag(cpu, 1u),
           "all-short cascade holds high through low RS");
    expect(state, dspic33_device_advance(cpu, 1u),
           "advance all-short cascade low-period boundary");
    expect(state,
           compare_raw_word(cpu, 0x0908u) == 0u &&
               compare_raw_word(cpu, 0x0912u) == 1u && output_is(cpu, 1u, true) &&
               interrupt_flag(cpu, 1u),
           "all-short cascade clears low timer and carries high at first period");

    dspic33_reset(cpu, 0u);
    configure_cascade(cpu, 0u, 7u, 4u, 2u, COMPARE_FP, COMPARE_SELF_SYNC, false);
    expect(state, dspic33_device_advance(cpu, 3u),
           "advance all-short center PWM output pipeline");
    expect(state, output_is(cpu, 1u, true) && !interrupt_flag(cpu, 1u),
           "all-short center PWM raises only the even output");
    expect(state, dspic33_device_advance(cpu, 2u),
           "advance all-short center PWM period boundary");
    expect(state,
           compare_raw_word(cpu, 0x0908u) == 0u &&
               compare_raw_word(cpu, 0x0912u) == 1u && output_is(cpu, 1u, true) &&
               interrupt_flag(cpu, 1u),
           "all-short center PWM follows cascade carry behavior");
}

static void cascade_access_activation_cases(OutputCompareConformance* state,
                                            Dspic33* cpu) {
    static const uint32_t program[] = {0x21c060u, 0x884800u, 0x000000u};
    size_t index;
    bool loaded = true;
    bool value;
    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, 0x0904u, 4u);
    dspic33_write_word(cpu, 0x090eu, 1u);
    dspic33_write_word(cpu, 0x0906u, 2u);
    dspic33_write_word(cpu, 0x0910u, 1u);
    dspic33_write_word(cpu, 0x090cu, 0x011fu);
    dspic33_write_word(cpu, 0x0902u, 0x013fu);
    dspic33_write_word(cpu, 0x090au, 0x1c06u);
    for (index = 0u; index < sizeof(program) / sizeof(program[0]); index++) {
        loaded = loaded && dspic33_load_program_word(
                               cpu, 0x200u + (uint32_t)(index * 2u), program[index]);
    }
    cpu->pc = 0x200u;
    expect(state, loaded, "load cascade instruction activation sequence");
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING && compare_raw_word(cpu, 0x0908u) == 0u,
           "cascade setup literal does not activate the timer");
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING &&
               compare_raw_word(cpu, 0x0908u) == 0u && output_is(cpu, 1u, false),
           "cascade enable takes effect after its instruction cycle");
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING && compare_raw_word(cpu, 0x0908u) == 1u,
           "cascade starts on the first clock after its enable instruction");

    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, 0x0904u, 4u);
    dspic33_write_word(cpu, 0x090eu, 1u);
    dspic33_write_word(cpu, 0x0906u, 2u);
    dspic33_write_word(cpu, 0x0910u, 1u);
    dspic33_write_byte(cpu, 0x090cu, 0x1fu);
    dspic33_write_byte(cpu, 0x090du, 0x01u);
    dspic33_write_byte(cpu, 0x090au, 0x06u);
    dspic33_write_byte(cpu, 0x090bu, 0x1cu);
    dspic33_write_byte(cpu, 0x0902u, 0x3fu);
    dspic33_write_byte(cpu, 0x0903u, 0x01u);
    dspic33_write_byte(cpu, 0x0900u, 0x06u);
    dspic33_write_byte(cpu, 0x0901u, 0x1cu);
    expect(state,
           !dspic33_output_compare_output(cpu, 0u, &value) &&
               output_is(cpu, 1u, false) && cpu->events.count == 1u,
           "cascade accepts documented byte-lane initialization");
    expect(state, dspic33_device_advance(cpu, 1u),
           "advance byte-configured cascade before inversion");
    dspic33_write_byte(cpu, 0x090du, 0x11u);
    expect(state,
           compare_raw_word(cpu, 0x0908u) == 1u && output_is(cpu, 1u, true) &&
               (cpu->io.output_compare.output_high & 2u) == 0u,
           "cascade inversion changes the even output without restarting the timer");
    dspic33_write_byte(cpu, 0x0903u, 0u);
    expect(state,
           output_is(cpu, 0u, true) &&
               !dspic33_output_compare_output(cpu, 1u, &value) &&
               compare_raw_word(cpu, 0x0908u) == 0u &&
               compare_raw_word(cpu, 0x0912u) == 0u,
           "clearing one byte-lane OC32 bit returns the low half to 16-bit mode");

    dspic33_reset(cpu, 0u);
    configure_cascade(cpu, 0u, 6u, UINT32_C(0x00010004), UINT32_C(0x00010002),
                      COMPARE_FP, COMPARE_SELF_SYNC, false);
    dspic33_write_word(cpu, 0x0698u, 0x0010u);
    dspic33_write_word(cpu, 0x0680u, 0x1100u);
    expect(state, !dspic33_output_compare_pin(cpu, 109u, &value),
           "cascade disconnects the odd PPS output");
    expect(state, pin_is(cpu, 65u, false), "cascade exposes the even PPS output");
    expect(state, dspic33_device_advance(cpu, UINT32_C(0x00010002)),
           "advance cascaded PPS compare");
    expect(state, pin_is(cpu, 65u, true),
           "cascaded even PPS output follows the 32-bit compare");
}

