tylertms/dspic33e-sim/conformance/output_compare.c
    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, timer_periods[1], 100u);
    dspic33_write_word(cpu, timer_controls[1], 0x8000u);
    configure_compare_mode(cpu, 0u, 6u, 100u, 50u, COMPARE_SELF_SYNC);
    expect(state, dspic33_device_advance(cpu, 1u),
           "advance FP clock before live source change");
    dspic33_write_word(cpu, 0x0900u, 0x0006u);
    expect(state, dspic33_device_advance(cpu, 1u),
           "advance Timer2 after live OC clock change");
    expect(state, dspic33_read_word(cpu, 0x0908u) == 2u,
           "live FP to Timer2 change preserves timer phase without double count");
    dspic33_write_word(cpu, 0x0900u, COMPARE_FP_EDGE_PWM);
    expect(state, dspic33_device_advance(cpu, 1u),
           "advance FP after restoring live OC clock");
    expect(state, dspic33_read_word(cpu, 0x0908u) == 3u,
           "live Timer2 to FP change preserves timer phase");
}

static void alternate_instruction_activation_cases(OutputCompareConformance* state,
                                                   Dspic33* cpu) {
    static const uint32_t program[] = {0x200040u, 0x884820u, 0x200020u, 0x884830u,
                                       0x200060u, 0x884800u, 0x000000u};
    size_t index;
    bool loaded = true;
    bool ran = true;
    dspic33_reset(cpu, 0x200u);
    dspic33_write_word(cpu, timer_periods[1], 100u);
    dspic33_write_word(cpu, timer_controls[1], 0x8000u);
    dspic33_write_word(cpu, 0x0902u, COMPARE_SELF_SYNC);
    for (index = 0u; index < sizeof(program) / sizeof(program[0]); index++) {
        loaded = loaded && dspic33_load_program_word(
                               cpu, 0x200u + (uint32_t)(index * 2u), program[index]);
    }
    expect(state, loaded, "load alternate-clock activation sequence");
    for (index = 0u; index < 6u; index++) {
        ran = ran && dspic33_step(cpu) == DSPIC33_RUNNING;
    }
    expect(state,
           ran && dspic33_read_word(cpu, 0x0908u) == 0u &&
               dspic33_read_word(cpu, timer_registers[1]) != 0u,
           "alternate OC enable instruction does not consume timer clocks");
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING &&
               dspic33_read_word(cpu, 0x0908u) == 1u,
           "alternate OC starts on first clock after enabling instruction");
}

static void trigger_instruction_transition_cases(OutputCompareConformance* state,
                                                 Dspic33* cpu) {
    static const uint32_t fp_program[] = {0x200c00u, 0x884810u, 0x000000u, 0x000000u,
                                          0x200800u, 0x884810u, 0x000000u};
    static const uint32_t timer_program[] = {0x200c00u, 0x884810u, 0x200800u, 0x884810u,
                                             0x000000u};
    size_t index;
    bool loaded = true;

    dspic33_reset(cpu, 0x200u);
    configure_compare_mode(cpu, 0u, 6u, 20u, 10u, COMPARE_TRIGGER);
    for (index = 0u; index < sizeof(fp_program) / sizeof(fp_program[0]); index++) {
        loaded = loaded && dspic33_load_program_word(
                               cpu, 0x200u + (uint32_t)(index * 2u), fp_program[index]);
    }
    expect(state, loaded, "load FP trigger-status instruction sequence");
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING &&
               dspic33_step(cpu) == DSPIC33_RUNNING &&
               (dspic33_read_word(cpu, 0x0902u) & COMPARE_TRIGGER_STATUS) != 0u &&
               dspic33_read_word(cpu, 0x0908u) == 0u,
           "FP trigger set instruction does not advance OC timer");
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING &&
               dspic33_read_word(cpu, 0x0908u) == 1u,
           "FP trigger set takes effect on the following clock");
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING &&
               dspic33_read_word(cpu, 0x0908u) == 2u &&
               dspic33_step(cpu) == DSPIC33_RUNNING &&
               dspic33_read_word(cpu, 0x0908u) == 3u,
           "FP trigger timer advances before clear instruction");
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING &&
               (dspic33_read_word(cpu, 0x0902u) & COMPARE_TRIGGER_STATUS) == 0u &&
               dspic33_read_word(cpu, 0x0908u) == 3u,
           "FP trigger clear instruction preserves OC timer");
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING &&
               dspic33_read_word(cpu, 0x0908u) == 0u,
           "FP trigger clear resets OC timer on the following clock");

    loaded = true;
    dspic33_reset(cpu, 0x200u);
    configure_compare_mode(cpu, 0u, 6u, 20u, 10u, COMPARE_TRIGGER);
    dspic33_write_word(cpu, 0x0900u, 0x0006u);
    for (index = 0u; index < sizeof(timer_program) / sizeof(timer_program[0]);
         index++) {
        loaded =
            loaded && dspic33_load_program_word(cpu, 0x200u + (uint32_t)(index * 2u),
                                                timer_program[index]);
    }
    expect(state, loaded && dspic33_step(cpu) == DSPIC33_RUNNING,
           "load prescaled Timer2 trigger-status instruction sequence");
    dspic33_write_word(cpu, timer_periods[1], 100u);
    dspic33_write_word(cpu, timer_controls[1], 0x8010u);
    expect(state, dspic33_device_advance(cpu, 7u),
           "advance Timer2 prescaler before trigger set instruction");
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING &&
               (dspic33_read_word(cpu, 0x0902u) & COMPARE_TRIGGER_STATUS) != 0u &&
               dspic33_read_word(cpu, 0x0908u) == 0u,
           "Timer2 trigger set instruction does not consume selected clock");
    expect(state,
           dspic33_device_advance(cpu, 7u) && dspic33_read_word(cpu, 0x0908u) == 0u &&
               dspic33_device_advance(cpu, 1u) && dspic33_read_word(cpu, 0x0908u) == 1u,
           "Timer2 trigger set takes effect on the following selected clock");
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING && dspic33_device_advance(cpu, 6u) &&
               dspic33_read_word(cpu, 0x0908u) == 1u,
           "align Timer2 prescaler before trigger clear instruction");
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING &&
               (dspic33_read_word(cpu, 0x0902u) & COMPARE_TRIGGER_STATUS) == 0u &&
               dspic33_read_word(cpu, 0x0908u) == 1u,
           "Timer2 trigger clear instruction preserves OC timer");
    expect(state,
           dspic33_device_advance(cpu, 7u) && dspic33_read_word(cpu, 0x0908u) == 1u &&
               dspic33_device_advance(cpu, 1u) && dspic33_read_word(cpu, 0x0908u) == 0u,
           "Timer2 trigger clear resets OC timer on the following selected clock");
}

static void synchronization_lifecycle_cases(OutputCompareConformance* state,
                                            Dspic33* cpu) {
    Dspic33 copy;
    bool initialized = dspic33_initialize(&copy);
    expect(state, initialized, "initialize synchronization lifecycle copy");
    if (!initialized) {
        return;
    }
    dspic33_reset(cpu, 0u);
    configure_compare_mode(cpu, 15u, 6u, 100u, 50u, 29u);
    expect(state,
           dspic33_schedule(cpu, DSPIC33_EVENT_INTERRUPT, 20u, 0u, 1u) &&
               dspic33_device_advance(cpu, 1u) && dspic33_copy(&copy, cpu),
           "copy pending OC synchronization");
    expect(state, dspic33_device_advance(cpu, 1u) && dspic33_device_advance(&copy, 1u),
           "advance original and copied synchronization");
    expect(state,
           dspic33_read_word(cpu, 0x099eu) == 0u &&
               dspic33_read_word(&copy, 0x099eu) == 0u && interrupt_flag(cpu, 15u) &&
               interrupt_flag(&copy, 15u) &&
               cpu->io.output_compare.sync_reset_pending ==
                   copy.io.output_compare.sync_reset_pending,
           "copied synchronization completes independently");

    dspic33_reset(cpu, 0u);
    configure_compare_mode(cpu, 15u, 6u, 4u, 2u, (uint16_t)(COMPARE_TRIGGER | 29u));
    expect(state,
           dspic33_schedule(cpu, DSPIC33_EVENT_INTERRUPT, 20u, 0u, 1u) &&
               dspic33_device_advance(cpu, 1u),
           "set trigger state before reset");
    dspic33_reset(cpu, 0u);
    expect(state,
           cpu->io.output_compare.sync_reset_pending == 0u &&
               cpu->io.output_compare.deferred_sync_pulses == 0u &&
               !cpu->io.output_compare.clock_advancing &&
               dspic33_read_word(cpu, 0x099eu) == 0u && cpu->events.count == 0u,
           "reset clears OC synchronization and trigger lifecycle");

    dspic33_reset(cpu, 0u);
    configure_compare_mode(cpu, 15u, 6u, 4u, 2u, (uint16_t)(COMPARE_TRIGGER | 24u));
    dspic33_write_word(cpu, 0x0a84u, 0x8040u);
    cpu->device_cycles = UINT64_MAX;
    expect(
        state,
        dspic33_comparator_input(cpu, 0u, DSPIC33_COMPARATOR_INPUT_POSITIVE, 1u, 0u) &&
            !dspic33_device_advance(cpu, 0u),
        "process trigger source at maximum device cycle");
    expect(state,
           cpu->stop_reason == DSPIC33_EVENT_QUEUE_ERROR &&
               (dspic33_read_word(cpu, 0x0996u) & 7u) == 0u && cpu->events.count == 0u,
           "trigger reschedule failure aborts OC channel");
    dspic33_destroy(&copy);
}

static void channel_trigger_matrix_cases(OutputCompareConformance* state,
                                         Dspic33* cpu) {
    uint8_t channel;
    for (channel = 0u; channel < DSPIC33_OUTPUT_COMPARE_COUNT; channel++) {
        uint16_t base = compare_base(channel);
        dspic33_reset(cpu, 0u);
        configure_compare_mode(cpu, channel, 6u, 4u, 2u,
                               (uint16_t)(COMPARE_TRIGGER | 29u));
        expect(state,
               dspic33_read_word(cpu, (uint16_t)(base + 8u)) == 0u &&
                   (dspic33_read_word(cpu, (uint16_t)(base + 2u)) &
                    COMPARE_TRIGGER_STATUS) == 0u,
               "channel trigger matrix starts held");
        expect(state,
               dspic33_schedule(cpu, DSPIC33_EVENT_INTERRUPT, 20u, 0u, 1u) &&
                   dspic33_device_advance(cpu, 1u),
               "channel trigger matrix emits source");
        expect(state,
               dspic33_read_word(cpu, (uint16_t)(base + 8u)) == 0u &&
                   (dspic33_read_word(cpu, (uint16_t)(base + 2u)) &
                    COMPARE_TRIGGER_STATUS) != 0u,
               "channel trigger matrix sets hardware status");
        expect(state, dspic33_device_advance(cpu, 1u),
               "channel trigger matrix advances first count");
        expect(state, dspic33_read_word(cpu, (uint16_t)(base + 8u)) == 1u,
               "channel trigger matrix counts after source");

        dspic33_reset(cpu, 0u);
        dspic33_write_word(cpu, (uint16_t)(base + 4u), 2u);
        dspic33_write_word(cpu, (uint16_t)(base + 6u), 1u);
        dspic33_write_word(cpu, base,
                           (uint16_t)(COMPARE_FP | COMPARE_TRIGGER_ONESHOT | 6u));
        dspic33_write_word(cpu, (uint16_t)(base + 2u),
                           (uint16_t)(COMPARE_TRIGGER | 29u));
        dspic33_write_word(cpu, (uint16_t)(base + 2u),
                           (uint16_t)(COMPARE_TRIGGER | COMPARE_TRIGGER_STATUS | 29u));
        expect(state,
               (dspic33_read_word(cpu, (uint16_t)(base + 2u)) &
                COMPARE_TRIGGER_STATUS) == 0u,
               "one-shot channel rejects software trigger set");
        expect(state,
               dspic33_schedule(cpu, DSPIC33_EVENT_INTERRUPT, 20u, 0u, 1u) &&
                   dspic33_device_advance(cpu, 1u),
               "one-shot channel accepts hardware trigger");
        dspic33_write_word(cpu, (uint16_t)(base + 2u),
                           (uint16_t)(COMPARE_TRIGGER | 29u));
        expect(state,
               (dspic33_read_word(cpu, (uint16_t)(base + 2u)) &
                COMPARE_TRIGGER_STATUS) != 0u,
               "one-shot channel rejects software trigger clear");
        expect(state, dspic33_device_advance(cpu, 3u),
               "one-shot channel advances to hardware clear");
        expect(state,
               (dspic33_read_word(cpu, (uint16_t)(base + 2u)) &
                COMPARE_TRIGGER_STATUS) == 0u,
               "one-shot channel clears trigger at rollover");
    }
}

